U04-D03-RAILS-FORMS-AND-HELPERS/CatApp/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])
      if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "breed" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "caron"], ["breed", "butler"], ["updated_at", "2018-02-08 20:21:54.745132"], ["id", 23]]

  def create
    @cat = Cat.new(cat_params)
      if @cat.save
---
INSERT INTO "cats" ("name", "breed", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "marshall"], ["breed", "who knows"], ["created_at", "2018-02-08 19:24:38.441299"], ["updated_at", "2018-02-08 19:24:38.441299"]]

  def destroy
    @cat = Cat.find(params[:id])
    @cat.destroy
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "cats" WHERE "cats"."id" = $1  [["id", 8]]